flameletModel-4.x/tutorials/flameletSimpleFoam/Sandia_COH2N2/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 0 2 -2 0 0 0 0 ];

internalField   uniform -17992.9;

boundaryField
{
    inletfuel           
    {
        type  		fixedValue;
	value		uniform -2.19608e+06;
    }

    inletair           
    {
        type  		fixedValue;
	value		uniform -17992.9;
    }

    outlet          
    {
        type  		zeroGradient;
    }

    sidewall       
    {
        type  		zeroGradient;
    }

    burnerwall
    {
        type  		zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
